Revit 2027 API
ExternalResourceTypes.BuiltInExternalResourceTypes.DecalBumpMap Property
 An external resource type representing Decal linked data for bump map. This type is reserved for future expansion but not yet implemented.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ExternalResourceType DecalBumpMap { get; }
Public Shared ReadOnly Property DecalBumpMap As ExternalResourceType
	Get
public:
static property ExternalResourceType^ DecalBumpMap {
	ExternalResourceType^ get ();
}
static member DecalBumpMap : ExternalResourceType with get
Property Value
ExternalResourceType
See Also
Reference
ExternalResourceTypes.BuiltInExternalResourceTypes Class
Autodesk.Revit.DB Namespace